cat_photo_api/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bea Stings"], ["img", ""], ["created_at", "2020-05-09 17:48:43.940138"], ["updated_at", "2020-05-09 17:48:43.940138"]]
---
  def create
    @cat = Cat.new(cat_params)

    if @cat.save

UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Rosie Peaches"], ["updated_at", "2020-05-09 17:05:40.333052"], ["id", 13]]
---
  def update
    if @cat.update(cat_params)

DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 3]]
---
  def destroy
    @cat.destroy

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_cat
      @cat = Cat.find(params[:id])